Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: For `Quarkus native 50 Mb` it was `50 millicores`, for `plain Java 180 Mb` and `Quarkus jvm 180 Mb` it was `240 millicores` (`Quarkus native 180 Mb` was out of scope since its "worst" result was 20 seconds as discussed in the first test). This meant that if time was our constraint, we could go from `240 millicores` to `50 millicores`, while going from `180 Mb` to `50 Mb` by moving to Quarkus native.
ja_jp: `Quarkus native 50 Mb` では `50 millicores` 、 `plain Java 180 Mb` と `Quarkus jvm 180 Mb` では `240 millicores` でした（ `Quarkus native 180 Mb` は、最初のテストで説明したように「最悪」の結果が 20 秒だったため、対象外となりました）。つまり、時間に制約がある場合は、 `240 millicores` から `50 millicores` へ、また、 `180 Mb` から `50 Mb` へは、Quarkus native へ移行することで対応できるということです。

source: For `dev` mode, this file can be placed in the root of the project, but it is advised to **not** check it in to version control because it typically contains passwords, access tokens, API keys or other secrets.
ja_jp: `dev` モードの場合、このファイルはプロジェクトのルートに置くことができるが、通常パスワードやアクセストークン、APIキーなどの秘密が含まれているため、バージョン管理にはチェックイン *しない* ことをお勧めします。

source: For `dev` mode, this file can be placed in the root of the project, but it is advised to **not** check it in to version control.
ja_jp: `dev` モードの場合、このファイルはプロジェクトのルートに置くことができますが、バージョン管理を選択 **しない** ことが推奨されます。

source: For `keycloak.version`, ensure the version is `26.1.3` or later.
ja_jp: `keycloak.version` の場合、バージョンが `26.1.3` 以降であることを確認してください。

source: For `text/plain` the `src/main/resources/templates/item.txt` template is used. For `text/html` the `META-INF/resources/templates/item.html` template is used.
ja_jp: `text/plain` では `src/main/resources/templates/item.txt` のテンプレートが使用されます。 `text/html` では `META-INF/resources/templates/item.html` のテンプレートが使用されます。

source: For a Basic Authentication configuration walk-through that uses `JPA`, see the xref:security-getting-started.adoc[Getting Started With Security] guide.
ja_jp: `JPA` を使用したベーシック認証の設定のウォークスルーについては、『 link:security-getting-started.html[Getting Started With Security] 』ガイドを参照してください。

source: For a Basic authentication configuration walk-through that uses `JPA`, see the xref:security-getting-started.adoc[Getting Started With Security] guide.
ja_jp: `JPA` を使用した Basic 認証設定のウォークスルーについては、 xref:security-getting-started.adoc[セキュリティ入門] ガイドを参照してください。

source: For a Narayana coordinator the path component of the url is normally `lra-coordinator`. Coordinators can be obtained from `https://hub.docker.com/r/jbosstm/lra-coordinator` or you can build your own coordinator using a maven pom that includes the appropriate dependencies. A Quarkus quickstart will be provided to show how to do this or you can take a look at one of the https://github.com/jbosstm/quickstart/tree/master/rts/lra-examples/lra-coordinator[Narayana quickstarts]. Another option would be to run it managed inside a WildFly application server.
ja_jp: ナラヤナのコーディネーターの場合、URLのパス部分は通常 `lra-coordinator` です。コーディネーターは以下から入手できます。 `https://hub.docker.com/r/jbosstm/lra-coordinator` また、適切な依存関係を含むmaven pomを使用して独自のコーディネーターを構築することもできます。この方法については、Quarkusのクイックスタートが提供されますが、 link:https://github.com/jbosstm/quickstart/tree/master/rts/lra-examples/lra-coordinator[Narayanaのクイックスタート]の1つを参照することもできます。もう一つの方法は、WildFlyアプリケーションサーバ内で管理された状態で実行することです。

source: For a Narayana coordinator the path component of the url is normally `lra-coordinator`. Coordinators can be obtained from https://quay.io/repository/jbosstm/lra-coordinator or you can build your own coordinator using a maven pom that includes the appropriate dependencies. A Quarkus quickstart will be provided to show how to do this, or you can take a look at one of the https://github.com/jbosstm/quickstart/tree/master/rts/lra-examples/lra-coordinator[Narayana quickstarts]. Another option would be to run it managed inside a WildFly application server.
ja_jp: ナラヤナのコーディネーターの場合、URLのパス部分は通常 `lra-coordinator` です。コーディネーターは `https://hub.docker.com/r/jbosstm/lra-coordinator` から入手できます。また、適切な依存関係を含むmaven pomを使用して独自のコーディネーターをビルドすることもできます。この方法については、Quarkusのクイックスタートが提供されます。また、 https://github.com/jbosstm/quickstart/tree/master/rts/lra-examples/lra-coordinator[Narayanaのクイックスタート]の1つを参照することもできます。もう一つの方法は、WildFlyアプリケーションサーバ内で管理された状態で実行することです。

source: For a Quarkus REST application, the minimum is around `40 MB`. The cache size grows as your application becomes larger.
ja_jp: Quarkus REST アプリケーションの場合、最小サイズは約 `40 MB` です。アプリケーションが大きくなるにつれてキャッシュサイズも大きくなります。

source: For a case study of how to eliminate reflection and what the performance benefits turned out to be, see https://quarkus.io/blog/quarkus-metaprogramming/[reflectionless Jackson serialization]
ja_jp: リフレクションを排除する方法と、それがパフォーマンスにどのようなメリットをもたらすかについてのケーススタディについては、 https://quarkus.io/blog/quarkus-metaprogramming/[リフレクションなしの Jackson のシリアル化] を参照してください。

source: For a detailed explanation, see this https://quarkus.io/blog/quarkus-devservices-testcontainers-podman/[blog article].
ja_jp: 詳しい説明は、こちらの https://quarkus.io/blog/quarkus-devservices-testcontainers-podman/[ブログ記事] を参照してください。

source: For a few years now I have been involved in a Kubernetes project, aiming at:
ja_jp: 数年前から、私はKubernetesのプロジェクトに参加しています。

source: For a full example of using Stork with Kubernetes, please read the xref:stork-kubernetes.adoc[Using Stork with Kubernetes guide].
ja_jp: KubernetesでStorkを使う詳しい例は、 xref:stork-kubernetes.adoc[Kubernetes で Stork を使用] をお読みください。

source: For a full list of possible statuses, check our https://quarkus.io/faq/#extension-status[FAQ entry].
ja_jp: とりうるステータスの完全なリストについては、 link:https://quarkus.io/faq/#extension-status[FAQの項目] を参照してください。

source: For a full list of possible statuses, check our https://quarkus.io/faq/#what-are-the-extension-statuses[FAQ entry].
ja_jp: とりうるステータスの完全なリストについては、 link:https://quarkus.io/faq/#extension-status[FAQの項目] を参照してください。

source: For a given application instance, the number of consumers inside the consumer group can be configured using `mp.messaging.incoming.$channel.concurrency` property. The partitions of the subscribed topic will be divided among the consumer threads. Note that if the `concurrency` value exceed the number of partitions of the topic, some consumer threads won't be assigned any partitions.
ja_jp: 特定のアプリケーションインスタンスの場合、コンシューマーグループ内のコンシューマーの数は、 `mp.messaging.incoming.$channel.concurrency` プロパティーを使用して設定できます。 サブスクライブされたトピックのパーティションは、コンシューマースレッド間で分割されます。 `concurrency` の値がトピックのパーティションの数を超える場合、一部のコンシューマスレッドにはパーティションが割り当てられないことに注意してください。

source: For a given application instance, the number of consumers inside the consumer group can be configured using `mp.messaging.incoming.$channel.partitions` property. The partitions of the subscribed topic will be divided among the consumer threads. Note that if the `partitions` value exceed the number of partitions of the topic, some consumer threads won't be assigned any partitions.
ja_jp: 特定のアプリケーションインスタンスの場合、コンシューマーグループ内のコンシューマーの数は、 `mp.messaging.incoming.$channel.partitions` プロパティーを使用して設定できます。サブスクライブされたトピックのパーティションは、コンシューマースレッド間で分割されます。 `partitions` の値がトピックのパーティションの数を超える場合、一部のコンシューマスレッドにはパーティションが割り当てられないことに注意してください。

source: For a list of all currently supported Qute features, please refer to the https://github.com/redhat-developer/vscode-quarkus/blob/master/CHANGELOG.md[changelog] for more information.
ja_jp: 現在サポートされているQuteの全機能のリストについては、 link:https://github.com/redhat-developer/vscode-quarkus/blob/master/CHANGELOG.md[変更履歴]を参照してください。

source: For a list of the items that you can set in `{config-file}`, see <<configuration-reference>>.
ja_jp: `{config-file}` で設定可能な項目のリストについては、 <<configuration-reference>> を参照してください。

source: For a list of the items that you can set in `{config-file}`, see <<hibernate-configuration-properties,Hibernate ORM configuration properties>>.
ja_jp: `{config-file}` で設定できる項目のリストについては、<<hibernate-configuration-properties,Hibernate ORM configuration properties>> を参照してください。

source: For a list of the items that you can set in `{config-file}`, see xref:hibernate-configuration-properties[Hibernate ORM configuration properties].
ja_jp: `{config-file}` で設定できる項目の一覧は、 xref:hibernate-configuration-properties[Hibernate ORM設定プロパティ] を参照してください。

source: For a long time, there has been the `io.quarkus:quarkus-jacoco` extension that integrates the https://www.jacoco.org/jacoco/index.html[JaCoCo code coverage library]. Nevertheless, until recently, it was not possible to measure the coverage of runtime modules for an extension project. In other words, it was possible to measure the coverage in your `@QuarkusTest`s but not in `QuarkusUnitTest`s, which typically constitute the majority of tests in extensions. Without adequate coverage support, developers were flying blind, uncertain whether their bytecode enhancements and recording logic were being effectively tested.
ja_jp: 長い間、https://www.jacoco.org/jacoco/index.html[JaCoCo コードカバレッジライブラリー]を統合する `io.quarkus:quarkus-jacoco` エクステンションが存在していました。しかし、最近まではエクステンションプロジェクトのランタイムモジュールのカバレッジを測定することは不可能でした。言い換えれば、`@QuarkusTest` ではカバレッジを測定できましたが、エクステンションのテストの大部分を占めるのが一般的な `QuarkusUnitTest` では測定できなかったのです。適切なカバレッジサポートがなければ、開発者は自身のバイトコード拡張やレコーディングロジックが効果的にテストされているかどうか確信が持てず、手探りの状態でした。

source: For a more customized configuration you can check the https://quarkus.io/guides/deploying-to-kubernetes[Deploying to Kubernetes guide]
ja_jp: さらに設定をカスタマイズする場合は、 https://quarkus.io/guides/deploying-to-kubernetes[Kubernetes へのデプロイガイド] を参照してください。

source: For a more customized configuration you can check the xref:deploying-to-kubernetes.adoc[Deploying to Kubernetes guide]
ja_jp: よりカスタマイズされた設定については、 xref:deploying-to-kubernetes.adoc[Kubernetesへのデプロイガイド] を参照してください。

source: For a more detailed guide about debugging native images please refer to the xref:native-reference.adoc[Native Reference Guide].
ja_jp: ネイティブイメージのデバッグに関する詳細なガイドについては、xref:native-reference.adoc[ネイティブリファレンスガイド] を参照してください。

source: For a more detailed overview of static metamodel, please refer to the link:{jakarta-persistence-spec-url}#a6072[Jakarta Persistence specification].
ja_jp: 静的メタモデルの詳細については、 link:{jakarta-persistence-spec-url}#a6072[Jakarta Persistence 仕様] を参照してください。

source: For a more detailed walk-through that shows you how to configure Basic authentication together with Jakarta Persistence for storing user credentials in a database, see the xref:security-getting-started-tutorial.adoc[Getting started with Security by using Basic authentication and Jakarta Persistence] guide.
ja_jp: ユーザー認証情報をデータベースに保存するために、Basic 認証と Jakarta Persistence を一緒に設定する方法に関する詳細なチュートリアルは、xref:security-getting-started-tutorial.adoc[Basic 認証と Jakarta Persistence を使用したセキュリティーの開始] ガイドを参照してください。

source: For a more robust approach that works on all Java versions, use the `junit-virtual-threads` extension described in the xref:testing-virtual-thread-applications[Testing virtual thread applications] section below. This extension uses JFR events to detect pinning and works consistently across Java 21, 24, and later versions.
ja_jp: すべての Java バージョンで機能するより堅牢なアプローチには、以下の xref:testing-virtual-thread-applications[Testing virtual thread applications] セクションで説明されている `junit-virtual-threads` エクステンションを使用してください。このエクステンションは JFR イベントを使用してピニングを検出し、Java 21、24、およびそれ以降のバージョンで一貫して動作します。

source: For a named datasource, you use the `@ReactiveDataSource` CDI qualifier with the datasource name as its value.
ja_jp: 名前付きデータソースの場合、値としてデータソース名を指定して `@ReactiveDataSource` CDI 修飾子を使用します。

source: For a native executable: `./target/lifecycle-quickstart-1.0-SNAPSHOT-runner -Dquarkus.args=<cmd-args>`
ja_jp: ネイティブ実行可能ファイルの場合: `./target/lifecycle-quickstart-1.0-SNAPSHOT-runner -Dquarkus.args=<cmd-args>`

source: For a native executable: `./target/myapp-runner -Dquarkus.datasource.password=youshallnotpass`
ja_jp: ネイティブ実行可能ファイルの場合: `./target/myapp-runner -Dquarkus.datasource.password=youshallnotpass`

source: For a native executable: `export QUARKUS_DATASOURCE_PASSWORD=youshallnotpass ; ./target/myapp-runner`
ja_jp: ネイティブ実行可能ファイルの場合: `export QUARKUS_DATASOURCE_PASSWORD=youshallnotpass ; ./target/myapp-runner`

source: For a page titled "Database view" in Agroal:
ja_jp: Agroal の「Database view」というタイトルのページの場合:

source: For a practical example, see the xref:security-getting-started-tutorial.adoc[Getting started with Security using Basic authentication and Jakarta Persistence] tutorial.
ja_jp: 実用的な例については、チュートリアル xref:security-getting-started-tutorial.adoc[Basic認証 とJakarta PersistenceによるQuarkus Security入門] を参照してください。

source: For a production-ready Apicurio Schema Registry, please see the https://www.apicur.io/registry/docs/apicurio-registry-operator/1.0.0/index.html[Apicurio Registry Operator documentation^]. You can also try out a https://console.redhat.com/application-services/service-registry[fully hosted and managed Schema Registry service^]!
ja_jp: Apicurio Schema Registryの本番環境については、 link:https://www.apicur.io/registry/docs/apicurio-registry-operator/1.0.0/index.html[Apicurio Registry Operatorのドキュメント, window=_blank]をご覧ください。また、 link:https://console.redhat.com/application-services/service-registry[完全にホストされ、管理されたスキーマ・レジストリ・サービス, window=_blank]を試すこともできます。

source: For a recommended approach of working with Auth0 access tokens, see the following <<token-propagation>> and <<jwt-access-tokens>> sections.
ja_jp: Auth0 アクセストークンの推奨される使用方法については、次の <<token-propagation>> セクションと<<jwt-access-tokens>> セクション を参照してください。

source: For a regular JVM distribution you need to base your image off the official AWS Java base images. Below is an example of a Dockerfile that would create a container image from your Quarkus Lambda project. It assumes that `mvn package` has been executed and binaries are available in the `target/` directory:
ja_jp: 通常の JVM ディストリビューションの場合は、公式の AWS Java ベースイメージに基づいてイメージを作成する必要があります。以下は、Quarkus Lambda プロジェクトからコンテナイメージを作成する Dockerfile の例です。 `mvn package` が実行され、バイナリーが `target/` ディレクトリーで利用可能であることを想定しています。

source: For a runner jar: `export QUARKUS_DATASOURCE_PASSWORD=youshallnotpass ; java -jar target/quarkus-app/quarkus-run.jar`
ja_jp: runner jar の場合: `export QUARKUS_DATASOURCE_PASSWORD=youshallnotpass ; java -jar target/quarkus-app/quarkus-run.jar`

source: For a runner jar: `java -Dquarkus.args=<cmd-args> -jar target/quarkus-app/quarkus-run.jar`
ja_jp: runner jarの場合: `java -Dquarkus.args=<cmd-args> -jar target/quarkus-app/quarkus-run.jar`

source: For a runner jar: `java -Dquarkus.datasource.password=youshallnotpass -jar target/quarkus-app/quarkus-run.jar`
ja_jp: runner jar の場合: `java -Dquarkus.datasource.password=youshallnotpass -jar target/quarkus-app/quarkus-run.jar`

source: For a semi-automatic service binding demonstration, see link:https://developers.redhat.com/articles/2021/12/22/how-use-quarkus-service-binding-operator#create_the_quarkus_application[How to use Quarkus with the Service Binding Operator]
ja_jp: 半自動のサービスバインディングのデモについては、link:https://developers.redhat.com/articles/2021/12/22/how-use-quarkus-service-binding-operator#create_the_quarkus_application[How to use Quarkus with the Service Binding Operator] を参照してください。

source: For a thorough understanding, we recommend you build the application by following the upcoming step-by-step instructions.
ja_jp: 完全に理解するために、次の手順に従ってアプリケーションをビルドすることを推奨します。

source: For a tutorial showing how to get started writing an application with persistence and Dev Services, see xref:getting-started-dev-services.adoc[Your Second Quarkus Application].
ja_jp: 永続化とDev Servicesを使用してアプリケーションを書き始める方法を示すチュートリアルについては、 xref:getting-started-dev-services.adoc[2つ目のQuarkusアプリケーション] を参照してください。

source: For a typical clustered Elasticsearch service, a sample configuration would look like the following:
ja_jp: 典型的なクラスタ化されたElasticsearchサービスの場合、サンプル設定は次のようになります:

source: For advanced configuration of the MongoDB client, you can follow the xref:mongodb.adoc#configuring-the-mongodb-database[Configuring the MongoDB database guide].
ja_jp: MongoDBクライアントの高度な設定については、 link:mongodb.html#configuring-the-mongodb-database[Configuring the MongoDB database ガイド]に従ってください。

source: For all cases other than the `BUILD_TIME` case, the configuration mapping interface and all the configuration groups and types contained therein must be located in, or reachable from, the extension's run time artifact. Configuration mappings of phase `BUILD_TIME` may be located in or reachable from either of the extension's run time or deployment artifacts.
ja_jp: `BUILD_TIME` 以外のすべての場合、設定マッピングインターフェースと、そこに含まれるすべての設定グループと型は、エクステンションの実行時アーティファクトに配置されるか、そこから到達可能でなければなりません。 `BUILD_TIME` フェーズの設定マッピングは、エクステンションの実行時アーティファクトまたはデプロイアメントアーティファクトのいずれかに配置されるか、そこから到達可能であれば大丈夫です。

source: For all cases other than the `BUILD_TIME` case, the configuration root class and all of the configuration groups and types contained therein must be located in, or reachable from, the extension's run time artifact. Configuration roots of phase `BUILD_TIME` may be located in or reachable from either of the extension's run time or deployment artifacts.
ja_jp: `BUILD_TIME` 以外のすべての場合、設定ルートクラスとそこに含まれるすべての設定グループと型は、エクステンションのランタイムアーティファクトに配置されるか、そこから到達可能でなければなりません。フェーズ `BUILD_TIME` の設定ルートは、エクステンションのランタイムアーティファクトまたはデプロイアメントアーティファクトのいずれかに位置するか、そこから到達することができます。

source: For all configuration properties, see the <<config-reference,Configuration reference>> section at the end of this guide.
ja_jp: すべての設定プロパティについては、本ガイドの最後にある <<config-reference,設定リファレンス>> セクションを参照してください。

source: For all configuration properties, see the <<config-reference>> section at the end of this guide.
ja_jp: すべての設定プ ロパテ ィ については、 こ のガ イ ド の最後にあ る <<config-reference>> セ ク シ ョ ン を参照 し て く だ さ い。

source: For all configuration properties, see the xref:config-reference[Configuration Reference] section at the end of this guide.
ja_jp: すべての設定プロパティについては、本ガイドの末尾にある xref:config-reference[設定リファレンス] のセクションを参照してください。

source: For all other use cases (e.g. tests, dev mode, and building the application) Quarkus uses the class loading architecture outlined here.
ja_jp: その他のすべてのユースケース(テスト、開発モード、アプリケーションのビルドなど)では、Quarkus はここで説明したクラスロードアーキテクチャを使用します。

source: For all other use cases (e.g. tests, dev mode, and building the application) Quarkus uses the class loading architecture outlined in following section.
ja_jp: その他のすべてのユースケース(テスト、開発モード、アプリケーションのビルドなど)では、Quarkus はここで説明したクラスロードアーキテクチャを使用します。

source: For all the details about the JDBC configuration options and configuring other aspects, such as the connection pool size, refer to the <<jdbc-configuration,JDBC configuration reference>> section.
ja_jp: JDBC設定オプションや、接続プール・サイズなどの他の側面の設定に関するすべての詳細については、 xref:jdbc-configuration[JDBC構成リファレンス] セクションを参照してください。

source: For all the instructions to install the Quarkus CLI, please refer to the https://quarkus.io/guides/cli-tooling[dedicated guide].
ja_jp: Quarkus CLIをインストールするためのすべての手順については、 link:https://quarkus.io/guides/cli-tooling[専用ガイド]を参照してください。

source: For an `HttpFunction`, you can use this command to launch your function locally.
ja_jp: `HttpFunction` の場合、以下のコマンドを使用しローカルで関数を起動することができます。

source: For an encrypted PKCS#8 private key, set the `quarkus.tls.key-store.pem.password` or `quarkus.tls.key-store.pem.<name>.password` property to the password that decrypts the private key.
ja_jp: 暗号化された PKCS#8 秘密鍵の場合、`quarkus.tls.key-store.pem.password` または `quarkus.tls.key-store.pem.<name>.password` プロパティーに、秘密鍵を復号するためのパスワードを設定します。

source: For an example of a workload projection where the directory structure is included in the test resources and passed to integration test, see the link:https://github.com/quarkusio/quarkus/tree/e7efe6b3efba91b9c4ae26f9318f8397e23e7505/integration-tests/kubernetes-service-binding-jdbc/src/test/resources/k8s-sb[Kubernetes Service Binding datasource] GitHub repository.
ja_jp: ディレクトリー構造をテストリソースに含めて統合テストに渡すワークロードの投影の例については、link:https://github.com/quarkusio/quarkus/tree/e7efe6b3efba91b9c4ae26f9318f8397e23e7505/integration-tests/kubernetes-service-binding-jdbc/src/test/resources/k8s-sb[Kubernetes Service Binding datasource] GitHub リポジトリーを参照してください。

source: For an example of practical use of Basic authentication and Jakarta Persistence, see the xref:security-basic-authentication-tutorial.adoc[Secure a Quarkus application with Basic authentication and Jakarta Persistence] tutorial.
ja_jp: Basic認証とJakarta Persistenceの実用的な使用例については、 xref:security-basic-authentication-tutorial.adoc[Basic認証とJakarta Persistenceを使用したQuarkusアプリケーションの保護] チュートリアルを参照してください。

source: For an example using a dev service which isn’t container-based, see the https://github.com/quarkusio/quarkus/pull/48753/files[Lambda conversion]. For a more complex conversion which uses compose, reuses existing external containers, and does post-start configuration, see just the `KafkaDevServicesProcessor` part of the https://github.com/quarkusio/quarkus/pull/48445/files#diff-77328c7968b5b6e5280c55994dd56cd1da637e84b1fecd751d6130e78840aefd[Kafka conversion].
ja_jp: コンテナーベースではない Dev Service を使用した例については、 https://github.com/quarkusio/quarkus/pull/48753/files[Lambda の変換] を参照してください。 compose を使用し、既存の外部コンテナーを再利用し、開始後の設定を行う、より複雑な変換については、 https://github.com/quarkusio/quarkus/pull/48445/files#diff-77328c7968b5b6e5280c55994dd56cd1da637e84b1fecd751d6130e78840aefd[Kafka の変換] の `KafkaDevServicesProcessor` 部分のみを参照してください。

source: For an explanation of what's in the generated application, see the xref:getting-started.adoc[First application guide].
ja_jp: 生成されたアプリケーションの中身の説明については、 xref:getting-started.adoc[最初のアプリケーションガイド] を参照してください。

source: For an init container to be able to perform the `wait for job` it needs to be able to perform `get` operations on the job resource. This is done automatically and the generated manifests include the required `Role` and `RoleBinding` resources.
ja_jp: init コンテナが `wait for job` を実行できるようにするには、ジョブ・リソースに対して `get` 操作を実行できる必要があります。 これは自動的に行われ、生成されたマニフェストには必要な `Role` と `RoleBinding` リソースが含まれます。

source: For an init container to be able to perform the `wait for job`, it needs to be able to perform `get` operations on the job resource. This is done automatically and the generated manifests include the required `Role` and `RoleBinding` resources.
ja_jp: init コンテナが `wait for job` を実行できるようにするには、ジョブ・リソース上で `get` 操作を実行できる必要があります。 これは自動的に行われ、生成されたマニフェストには必要な `Role` および `RoleBinding` リソースが含まれます。

source: For any given Quarkus project open in Visual Studio Code with the Quarkus Tools for Visual Studio Code extension installed, all `\*.html`, `*.txt`, `\*.yaml` and `*.json` files under `src/main/resources/templates` will receive Qute support and syntax highlighting. Additionally, all `\*.qute.*` added before the above extension files (i.e. `*.qute.html`) will also benefit from Qute support features. To check if the current file is supported, ensure the _Select Language Mode_ option has selected one of the following:
ja_jp: Quarkus Tools for Visual Studio CodeエクステンションをインストールしたVisual Studio Codeで開く任意のQuarkusプロジェクトでは、 `src/main/resources/templates` 以下のすべての `*.html` 、 `*.txt` 、 `*.yaml` 、 `*.json` ファイルにQuteサポートと構文の強調表示が提供されます。さらに、上記の拡張ファイルの前に追加されたすべての `*.qute.*` （すなわち、 `*.qute.html` ）も、Qute サポート機能の恩恵を受けることができます。現在のファイルがサポートされているかどうかを確認するには、「 _言語モードの選択_」オプションで、以下のいずれかが選択されていることを確認してください。

source: For any other versions, the native configuration may need to be adjusted.
ja_jp: それ以外のバージョンでは、ネイティブコンフィギュレーションの調整が必要な場合があります。

source: For applications running in a production environment, do not store passwords as plain text.
ja_jp: 本番環境で動作するアプリケーションでは、パスワードをプレーンテキストとして保存しないでください。

source: For applying retry mechanism on processing errors, see the section on <<retrying-processing>>.
ja_jp: 処理エラー時の再試行メカニズムの適用については、<<retrying-processing>> のセクションを参照してください。

source: For background functions, you launch the invoker with a target class of `io.quarkus.funqy.gcp.functions.FunqyBackgroundFunction`.
ja_jp: バックグラウンド関数の場合は、 `io.quarkus.funqy.gcp.functions.FunqyBackgroundFunction` のターゲットクラスで invoker を起動します。
